---
kind: other
id: Properties.T:Autodesk.Revit.DB.FilterableValueProvider
source: html/1d2973c4-d962-3a2e-3e3e-454f4a454031.htm
---
# FilterableValueProvider Properties

Specifies whether the .NET object represents a valid Revit entity.